case_04/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    waterInlet
    {
        type            fixedFluxPressure;
    }
    airInlet
    {
        type            fixedFluxPressure;
    }
    outlet
    {
        type            waveTransmissive;
        value           uniform 101325;
        field           p;
        gamma           1.4;
        phi             phi;
        rho             thermo:rho;
        psi             thermo:psi;
        lInf            5;
        fieldInf        101325;
    }
    freestream
    {
        type            fixedValue;
        value           uniform 101325;
    }
    walls
    {
        type            fixedFluxPressure;
    }
    axis
    {
        type            empty;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}

// ************************************************************************* //
